In [ ]:
import modin.pandas as pd

#### pandas 是基于 Numpy 构建的含有更高级数据结构和工具的数据分析包
- Numpy 核心数据结构 ndarray，
- pandas 核心数据结构 Series 和 DataFrame

Dask，一个专门用来做大数据存储读取以及并行计算的库，可以提升numpy, pandas, sklearn这些库的运行效率

In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [3]:
df = pd.DataFrame({'A': ['a', 'b', 'a', 'c', 'a', 'c', 'b', 'c'],
                   'B': [[2,1], [8,1], [1,1], [4,2], [3,2], [2,2], [5,2], [9,8]]})
print(df)
# g = df.groupby(by="A").apply(lambda x:[','.join(str(x['B']))]).reset_index()
# print(g[0])

g = df.groupby(by="A").sum()
print(g)

A       B
0  a  [2, 1]
1  b  [8, 1]
2  a  [1, 1]
3  c  [4, 2]
4  a  [3, 2]
5  c  [2, 2]
6  b  [5, 2]
7  c  [9, 8]
                    B
A
a  [2, 1, 1, 1, 3, 2]
b        [8, 1, 5, 2]
c  [4, 2, 2, 2, 9, 8]

In [4]:
df_html = df.to_html()
df_html

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>A</th>\n      <th>B</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>a</td>\n      <td>[2, 1]</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>b</td>\n      <td>[8, 1]</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>a</td>\n      <td>[1, 1]</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>c</td>\n      <td>[4, 2]</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>a</td>\n      <td>[3, 2]</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>c</td>\n      <td>[2, 2]</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>b</td>\n      <td>[5, 2]</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>c</td>\n      <td>[9, 8]</td>\n    </tr>\n  </tbody>\n</table>'

In [6]:
# df.to_markdown()

### merge_asof
通过最近的key（比如时间戳）合并DataFrame。

### 数据读入

https://www.cnblogs.com/snaildev/archive/2018/04/22/8907952.html

https://www.jianshu.com/p/238a13995b2b

In [3]:
"""
skiprows 跳过指定行
parse_dates 解析数据为日期
nrows 指定需要读取的行数
"""

names = ["col0", "col1"]
user_col = [0,1]
df = pd.read_table("./data/test.csv",sep=",")
df

     tag  weight       datetime
0     公司    83.2  2018-08-15-13
1   招商银行    69.8            NaN
2   中信银行    47.4            NaN
3   平安银行    46.6            NaN
4   工商银行    46.2            NaN
5     建行    43.4            NaN
6   建设银行    43.4            NaN
7   中国银行    43.0            NaN
8   农业银行    42.6            NaN
9     阿里     NaN            NaN
10    小米    23.0            NaN
11    小米    23.0            NaN

### DataFrame

In [27]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [28]:
df.tail(2)

   tag  weight datetime
10  小米    23.0      NaN
11  小米    23.0      NaN

In [63]:
df.loc[3:6]

    tag  weight datetime
3  平安银行    46.6      NaN
4  工商银行    46.2      NaN
5    建行    43.4      NaN
6  建设银行    43.4      NaN

In [55]:
df[df["weight"]>46]

    tag  weight       datetime
0    公司    83.2  2018-08-15-13
1  招商银行    69.8            NaN
2  中信银行    47.4            NaN
3  平安银行    46.6            NaN
4  工商银行    46.2            NaN

In [3]:
# 包含-过滤
bool = df.tag.str.contains('银行')
df[bool]

    tag  weight datetime
1  招商银行    69.8      NaN
2  中信银行    47.4      NaN
3  平安银行    46.6      NaN
4  工商银行    46.2      NaN
6  建设银行    43.4      NaN
7  中国银行    43.0      NaN
8  农业银行    42.6      NaN

In [8]:

df.loc[df["weight"]>46,"datetime"] = 100

In [9]:
df

     tag  weight datetime
0     公司    83.2      100
1   招商银行    69.8      100
2   中信银行    47.4      100
3   平安银行    46.6      100
4   工商银行    46.2      100
5     建行    43.4      NaN
6   建设银行    43.4      NaN
7   中国银行    43.0      NaN
8   农业银行    42.6      NaN
9     阿里     NaN      NaN
10    小米    23.0      NaN
11    小米    23.0      NaN

In [30]:
df.at[0,"tag"] # 第一行

'公司'

In [35]:
df.isnull().sum()

tag          0
weight       1
datetime    11
dtype: int64

In [36]:
df[df.weight.notnull()]  # 指定某一列，过滤NaN的记录

     tag  weight            datetime
0     公司    83.2 2018-08-15 13:00:00
1   招商银行    69.8                 NaT
2   中信银行    47.4                 NaT
3   平安银行    46.6                 NaT
4   工商银行    46.2                 NaT
5     建行    43.4                 NaT
6   建设银行    43.4                 NaT
7   中国银行    43.0                 NaT
8   农业银行    42.6                 NaT
10    小米    23.0                 NaT
11    小米    23.0                 NaT

In [37]:
df.dropna(how="any") # 默认丢弃任何含有缺失的行how='any'，传入how='all'将只丢弃全为NA的那些行

  tag  weight            datetime
0  公司    83.2 2018-08-15 13:00:00

In [38]:
df.dropna(subset=["weight"], how='all')  # 对特定列操作

     tag  weight            datetime
0     公司    83.2 2018-08-15 13:00:00
1   招商银行    69.8                 NaT
2   中信银行    47.4                 NaT
3   平安银行    46.6                 NaT
4   工商银行    46.2                 NaT
5     建行    43.4                 NaT
6   建设银行    43.4                 NaT
7   中国银行    43.0                 NaT
8   农业银行    42.6                 NaT
10    小米    23.0                 NaT
11    小米    23.0                 NaT

In [41]:
# 在原DataFrame中修改，则把inplace设置为True,不返回
#  inplace == False ，返回新的DataFrame
# method : {‘backfill’, ‘bfill’, ‘pad’, ‘ffill’, None}, default None
df_0 = df.fillna(0) # 缺失值补零
df_0

     tag  weight             datetime
0     公司    83.2  2018-08-15 13:00:00
1   招商银行    69.8                    0
2   中信银行    47.4                    0
3   平安银行    46.6                    0
4   工商银行    46.2                    0
5     建行    43.4                    0
6   建设银行    43.4                    0
7   中国银行    43.0                    0
8   农业银行    42.6                    0
9     阿里     0.0                    0
10    小米    23.0                    0
11    小米    23.0                    0

In [42]:
df.fillna(method='bfill') # 缺失值用平均值补齐

     tag  weight            datetime
0     公司    83.2 2018-08-15 13:00:00
1   招商银行    69.8                 NaT
2   中信银行    47.4                 NaT
3   平安银行    46.6                 NaT
4   工商银行    46.2                 NaT
5     建行    43.4                 NaT
6   建设银行    43.4                 NaT
7   中国银行    43.0                 NaT
8   农业银行    42.6                 NaT
9     阿里    23.0                 NaT
10    小米    23.0                 NaT
11    小米    23.0                 NaT

In [45]:
# 重命名列名
df.rename(columns = {"weight": "weights", "tag":"company"},  inplace=True)
df

   company  weights            datetime
0       公司     83.2 2018-08-15 13:00:00
1     招商银行     69.8                 NaT
2     中信银行     47.4                 NaT
3     平安银行     46.6                 NaT
4     工商银行     46.2                 NaT
5       建行     43.4                 NaT
6     建设银行     43.4                 NaT
7     中国银行     43.0                 NaT
8     农业银行     42.6                 NaT
9       阿里      NaN                 NaT
10      小米     23.0                 NaT
11      小米     23.0                 NaT

In [46]:
df.first_valid_index

<bound method NDFrame.first_valid_index of    company  weights            datetime
0       公司     83.2 2018-08-15 13:00:00
1     招商银行     69.8                 NaT
2     中信银行     47.4                 NaT
3     平安银行     46.6                 NaT
4     工商银行     46.2                 NaT
5       建行     43.4                 NaT
6     建设银行     43.4                 NaT
7     中国银行     43.0                 NaT
8     农业银行     42.6                 NaT
9       阿里      NaN                 NaT
10      小米     23.0                 NaT
11      小米     23.0                 NaT>

In [49]:
# reset_index可以还原索引，从新变为默认的整型索引 
df1 = df.reset_index(drop=True)
df1

   company  weights            datetime
0       公司     83.2 2018-08-15 13:00:00
1     招商银行     69.8                 NaT
2     中信银行     47.4                 NaT
3     平安银行     46.6                 NaT
4     工商银行     46.2                 NaT
5       建行     43.4                 NaT
6     建设银行     43.4                 NaT
7     中国银行     43.0                 NaT
8     农业银行     42.6                 NaT
9       阿里      NaN                 NaT
10      小米     23.0                 NaT
11      小米     23.0                 NaT

In [34]:
# 时间格式转换
df_dt = pd.to_datetime(df.datetime)
df.datetime = pd.to_datetime(df.datetime)
print(df)

     tag  weight            datetime
0     公司    83.2 2018-08-15 13:00:00
1   招商银行    69.8                 NaT
2   中信银行    47.4                 NaT
3   平安银行    46.6                 NaT
4   工商银行    46.2                 NaT
5     建行    43.4                 NaT
6   建设银行    43.4                 NaT
7   中国银行    43.0                 NaT
8   农业银行    42.6                 NaT
9     阿里     NaN                 NaT
10    小米    23.0                 NaT
11    小米    23.0                 NaT

In [5]:
from pandas.core.frame import DataFrame
a=[[1,2,3,4],[5,6,7]]#包含两个不同的子列表[1,2,3,4]和[5,6,7,8]
data=DataFrame(a)#这时候是以行为标准写入的
print(data)

   0  1  2    3
0  1  2  3  4.0
1  5  6  7  NaN

### 索引

https://blog.csdn.net/flyfish5/article/details/79852938

In [10]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.765351  2.751209  0.576987
Ohio   -0.653587  0.487271  0.214690
Texas  -1.002998  0.400189 -0.910545
Oregon  0.659802 -1.256498  0.177078

In [65]:
frame.loc["Utah"]  # 行

b   -0.765351
d    2.751209
e    0.576987
Name: Utah, dtype: float64

In [68]:
# 切片
frame.loc["Utah":"Texas"]

              b         d         e
Utah  -0.765351  2.751209  0.576987
Ohio  -0.653587  0.487271  0.214690
Texas -1.002998  0.400189 -0.910545

In [67]:
frame.loc[frame['d']>0.48,["b","d"]] # 使用布尔筛选

             b         d
Utah -0.765351  2.751209
Ohio -0.653587  0.487271

In [72]:
frame.iloc[2] # 取行

b   -1.002998
d    0.400189
e   -0.910545
Name: Texas, dtype: float64

In [73]:
frame[['b','e']] # loc和iloc只输入一维时选取的是行，而[]选取的是列，并且必须使用列名

               b         e
Utah   -0.765351  0.576987
Ohio   -0.653587  0.214690
Texas  -1.002998 -0.910545
Oregon  0.659802  0.177078

#### apply

df["列名"]=df.apply(lambda x:方法名(x,入参2),axis=1)

lambda x: self.bug_rule(x, "IntegrationTest")

In [13]:
# frame.colums["Utah"]
f = lambda x: x.max() - x.min()
print(frame.apply(f))  # f 作用每一列

print(frame.apply(f,axis=1))  # 作用于行

f = lambda x: '%.2f' % x
print(frame.applymap(f))  # 作用于每一个元素

b    1.662801
d    4.007707
e    1.487533
dtype: float64
Utah      3.516560
Ohio      1.140858
Texas     1.403188
Oregon    1.916300
dtype: float64
            b      d      e
Utah    -0.77   2.75   0.58
Ohio    -0.65   0.49   0.21
Texas   -1.00   0.40  -0.91
Oregon   0.66  -1.26   0.18

In [74]:
def plus(a):
    return a+100.0
def convert(frame):
    return plus(frame['e'])
f = lambda x: convert(x)

frame.apply(f,axis=1)  # 作用于某列的每一行

Utah      100.576987
Ohio      100.214690
Texas      99.089455
Oregon    100.177078
dtype: float64

In [95]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'], 'key2': ['one', 'two', 'one', 'three', 'one'],
                   'data1': np.random.randn(5), 'data2': np.random.randn(5)})
df

  key1   key2     data1     data2
0    a    one  1.325306 -1.419478
1    a    two -1.323528 -0.218968
2    b    one  0.612829  0.456934
3    b  three -0.950489 -0.985701
4    a    one -1.400108 -0.001935

### groupby

In [133]:
cols1 = df["key1"].drop_duplicates().to_list() # 去重

In [120]:
gbs = df.groupby(by=['key1', 'key2'])["data1"].count()
gbs

key1  key2
a     one      2
      two      1
b     one      1
      three    1
Name: data1, dtype: int64

In [122]:
indexs = gbs.index
indexs

MultiIndex([('a',   'one'),
            ('a',   'two'),
            ('b',   'one'),
            ('b', 'three')],
           names=['key1', 'key2'])

In [116]:
gbs["b"]

key2
one      1
three    1
Name: data1, dtype: int64

In [109]:
# gbs["b"]["two"] = 0
gbs["b"]["three"]

1

In [134]:
columns = ["one","two","three"]
for index in cols1:
    for col in columns:
        try:
            print(gbs[index[0],col])
        except Exception as e:
            print(0)

2
1
0
1
0
1

In [ ]:
def series2df():
    new_pd = {}

In [81]:
df = pd.DataFrame({'animal': 'cat dog cat fish dog cat cat'.split(),
                  'size': list('SSMMMLL'),
                  'weight': [8, 10, 11, 1, 20, 12, 12],
                  'adult' : [False] * 5 + [True] * 2});

group=df.groupby("animal")
cat=group.get_group("cat")
cat

  animal size  weight  adult
0    cat    S       8  False
2    cat    M      11  False
5    cat    L      12   True
6    cat    L      12   True

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.932116 -1.119557
1    a  two -1.162905  0.751658
4    a  one -0.262221  0.992591
b
  key1 key2     data1     data2
2    b  one  1.841545 -0.682517
3    b  two -1.527220 -1.814503

In [17]:
# 多键的情况
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  0.932116 -1.119557
4    a  one -0.262221  0.992591
a two
  key1 key2     data1     data2
1    a  two -1.162905  0.751658
b one
  key1 key2     data1     data2
2    b  one  1.841545 -0.682517
b two
  key1 key2    data1     data2
3    b  two -1.52722 -1.814503

In [19]:
df = pd.read_table("./data/test.csv",sep=",")
print(df.values)

gp=df.groupby('tag')  # 按某一列关键字分组
print(gp.count())

[['公司' 83.2 '2018-08-15-13']
 ['招商银行' 69.8 nan]
 ['中信银行' 47.40000000000001 nan]
 ['平安银行' 46.6 nan]
 ['工商银行' 46.2 nan]
 ['建行' 43.40000000000001 nan]
 ['建设银行' 43.40000000000001 nan]
 ['中国银行' 43.00000000000001 nan]
 ['农业银行' 42.60000000000001 nan]
 ['阿里' nan nan]
 ['小米' 23.0 nan]
 ['小米' 23.0 nan]]
      weight  datetime
tag
中信银行       1         0
中国银行       1         0
公司         1         1
农业银行       1         0
小米         2         0
工商银行       1         0
平安银行       1         0
建行         1         0
建设银行       1         0
招商银行       1         0
阿里         0         0

#### sort
pandas 根据某一列排序

pandas排序的方法有很多，sort_values表示根据某一列排序

pd.sort_values("xxx",inplace=True)

表示pd按照xxx这个字段排序，inplace默认为False,如果该值为False，那么原来的pd顺序没变，只是返回的是排序的

In [20]:
print(gp.sum())

      weight
tag
中信银行    47.4
中国银行    43.0
公司      83.2
农业银行    42.6
小米      46.0
工商银行    46.2
平安银行    46.6
建行      43.4
建设银行    43.4
招商银行    69.8
阿里       0.0

In [21]:
a = np.random.randn(5)
a

array([-0.78072644,  0.35565585,  1.27734654, -0.56870175,  0.89606337])

#### Series

In [22]:
s = Series(a)
s

0   -0.780726
1    0.355656
2    1.277347
3   -0.568702
4    0.896063
dtype: float64

In [24]:
s = Series(data=[1, 3, 5, 7], index = ['a', 'b', 'x', 'y'])
print(s.values)
print(s.index)

[1 3 5 7]
Index(['a', 'b', 'x', 'y'], dtype='object')

In [25]:
d = {'one' : Series([1.,2.,3.] , index=['a' , 'b' , 'c']),
     'two' : Series([1.,2.,3.,4.] , index=['a' , 'b' , 'c' , 'd'])}
df = DataFrame(d)
print(df)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

### df保存
1、是否保留列名 header: Whether to write out the column names (default True)

df.to_csv(‘path/Result.csv’,header=0) #不保存列名

2、是否保留行索引 index: whether to write row (index) names (default True)

df.to_csv(‘path/Result1.csv’,index=0) #不保存行索引

### dataframe2numpy
使用Numpy中的array方法

np.array(df)

#### pandas 合并

In [5]:
import pandas as pd
# 定义生成DataFrame的函数：
def make_df(cols,index): 
    data = {col:[str(col)+str(ind) for ind in index] for col in cols}  
    df = pd.DataFrame(data = data,columns = cols ,index = index )
    return df

In [6]:
df1 = make_df(['a','b','c'],[1,2,3])

In [7]:
df2 = make_df(['a','b','c'],[4,5,6])

In [8]:
pd.concat([df1,df2],axis=0)

    a   b   c
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5
6  a6  b6  c6

In [9]:
# jupyter 中显示完整表格
pd.set_option('max_columns',1000)
pd.set_option('max_row',300)
pd.set_option('display.float_format',lambda x:'%.5f' % x)